---
title: RenderingQualitySettings
classe: Autodesk.Revit.DB.RenderingQualitySettings
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# RenderingQualitySettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `renderingQualitySettings.IsValidObject` | Boolean |
| `LightAndMaterialAccuracyMode LightAndMaterialAccuracyMode { get; set; }` | `renderingQualitySettings.LightAndMaterialAccuracyMode` | LightAndMaterialAccuracyMode |
| `RenderDuration RenderDuration { get; set; }` | `renderingQualitySettings.RenderDuration` | RenderDuration |
| `RenderingQuality RenderingQuality { get; set; }` | `renderingQualitySettings.RenderingQuality` | RenderingQuality |
| `Int32 RenderLevel { get; set; }` | `renderingQualitySettings.RenderLevel` | Int32 |
| `Int32 RenderTime { get; set; }` | `renderingQualitySettings.RenderTime` | Int32 |
| `Void Dispose()` | `renderingQualitySettings.Dispose()` | Void |
| `Boolean IsCustomQuality()` | `renderingQualitySettings.IsCustomQuality()` | Boolean |
| `Boolean IsValidRenderLevel(Int32)` | `renderingQualitySettings.IsValidRenderLevel(value)` | Boolean |
| `Boolean IsValidRenderTime(Int32)` | `renderingQualitySettings.IsValidRenderTime(value)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```